AplicacionesHibridas/app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
    def index
        @images = Image.all     #variable de tipo array @images

INSERT INTO "images" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "añkhflkmASDLMKF"], ["created_at", "2018-08-24 02:21:58.283188"], ["updated_at", "2018-08-24 02:21:58.283188"]]
---
    def create
        #render plain: params[:image].inspect
        @image = Image.new images_params
        @image.save

UPDATE "images" SET "description" = $1, "updated_at" = $2 WHERE "images"."id" = $3  [["description", "jmjpo´{p"], ["updated_at", "2018-08-29 00:38:01.195354"], ["id", 1]]
---
    def update
         # buscamos nuestro id del objeto imagen
        @image.update images_params

SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_image
        @image = Image.find params[:id]